; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-24)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room6)
(at ball24 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 24
2. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 12 of 24
3. (pick ball22 room5 left)
   deleted: (at ball22 room5) (free left)
   added: (carry ball22 left)
   goals met: 12 of 24
4. (pick ball21 room5 right)
   deleted: (at ball21 room5) (free right)
   added: (carry ball21 right)
   goals met: 12 of 24
5. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 12 of 24
6. (drop ball21 room6 right)
   deleted: (carry ball21 right)
   added: (at ball21 room6) (free right)
   goals met: 13 of 24
7. (drop ball22 room6 left)
   deleted: (carry ball22 left)
   added: (at ball22 room6) (free left)
   goals met: 14 of 24
8. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 14 of 24
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 14 of 24
10. (pick ball18 room4 left)
   deleted: (at ball18 room4) (free left)
   added: (carry ball18 left)
   goals met: 14 of 24
11. (pick ball17 room4 right)
   deleted: (at ball17 room4) (free right)
   added: (carry ball17 right)
   goals met: 14 of 24
12. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 14 of 24
13. (drop ball17 room5 right)
   deleted: (carry ball17 right)
   added: (at ball17 room5) (free right)
   goals met: 15 of 24
14. (drop ball18 room5 left)
   deleted: (carry ball18 left)
   added: (at ball18 room5) (free left)
   goals met: 16 of 24
15. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 16 of 24
16. (pick ball16 room4 left)
   deleted: (at ball16 room4) (free left)
   added: (carry ball16 left)
   goals met: 16 of 24
17. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 16 of 24
18. (drop ball16 room5 left)
   deleted: (carry ball16 left)
   added: (at ball16 room5) (free left)
   goals met: 17 of 24
19. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 17 of 24
20. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 17 of 24
21. (pick ball9 room3 left)
   deleted: (at ball9 room3) (free left)
   added: (carry ball9 left)
   goals met: 17 of 24
22. (pick ball8 room3 right)
   deleted: (at ball8 room3) (free right)
   added: (carry ball8 right)
   goals met: 17 of 24
23. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 17 of 24
24. (drop ball8 roomb right)
   deleted: (carry ball8 right)
   added: (at ball8 roomb) (free right)
   goals met: 18 of 24
25. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 19 of 24
26. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 19 of 24
27. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 19 of 24
28. (pick ball6 room3 right)
   deleted: (at ball6 room3) (free right)
   added: (carry ball6 right)
   goals met: 19 of 24
29. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 19 of 24
30. (drop ball6 roomb right)
   deleted: (carry ball6 right)
   added: (at ball6 roomb) (free right)
   goals met: 20 of 24
31. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 21 of 24
32. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 21 of 24
33. (pick ball5 room3 left)
   deleted: (at ball5 room3) (free left)
   added: (carry ball5 left)
   goals met: 21 of 24
34. (pick ball13 room3 right)
   deleted: (at ball13 room3) (free right)
   added: (carry ball13 right)
   goals met: 21 of 24
35. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 21 of 24
36. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 22 of 24
37. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 22 of 24
38. (drop ball13 room4 right)
   deleted: (carry ball13 right)
   added: (at ball13 room4) (free right)
   goals met: 23 of 24
39. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 23 of 24
40. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 23 of 24
41. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 23 of 24
42. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 23 of 24
43. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 24 of 24
